Revit 2026 API

# IRebarUpdateServer Methods

---

The IRebarUpdateServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GenerateCurves | This function is supposed to calculate the bars in set based on data received in curvesData parameter. |
|  | GetCustomHandleName | This function should return the name of the handle. |
|  | GetCustomHandles | This function should define all handles that the Rebar has. This function is called when the Rebar is created. |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetHandlesPosition | This function is supposed to provide the positions of handles defined in GetCustomHandles(). These positions will be shown on screen when the bar constraints are edited. If a position for a handle isn't provided, that handle will not be represented on screen while edit constraints.This function is called when edit constraints command is lunched or during edit constraints after a constraint was changed and the curve calculation was done. |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | TrimExtendCurves | This function is supposed to trim or extend curves that were obtained from calling GenerateCurves(). Also in this function can be set new constraints for start and end handles. |

#### Reference

IRebarUpdateServer Interface

Autodesk.Revit.DB.Structure Namespace